GCTuner/tsungtesting/tsung.xml
<tsung loglevel="info" version="1.0">
  <clients>
    <client host="localhost" cpu="4" maxusers="1000"/>
  </clients>

  <servers>
    <server host="18.144.10.205" port="8080" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <increment arrivalrate="5" unit="second" from="5" to="30"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <decrement arrivalrate="5" unit="second" from="30" to="5"/>
    </arrivalphase>
  </load>

  <sessions>
    <session probability="100" name="mergesort" type="ts_http">
      <!-- Send /insert request -->
      <request>
        <http url="/mergesort" method="GET">
          <!-- Wait for the response before proceeding -->
          <thinktime value="response"/>
        </http>
      </request>
    </session>
  </sessions>
</tsung>